app/controllers/flower_shop_controller.rb

	def wholeseller
		@users=User.all
		@wholesellers=User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

	def retailer
		@users=User.all
		@retailers=User.find(params[:id])
---
SELECT `users`.* FROM `users`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

	def customer
		@users=User.all
		@customers=User.find(params[:id])
---
SELECT `users`.* FROM `users`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

	def create
		user_email=params.require("user").permit(:emailid)
		@userss=User.new(params.require("user").permit(:name,:emailid))
		@user_check=@userss.save
		if @user_check
			flash[:notice]="hi"
			@roles=@userss.roles.new(params.require("user").permit(:wholeseller,:customer,:retailer))
			@role_check=@roles.save
---
INSERT INTO `users` (`name`, `emailid`, `created_at`, `updated_at`) VALUES ('prasanth', 'prasanthramal@gmail.com', '2015-01-30 09:37:23.934641', '2015-01-30 09:37:23.934641')
INSERT INTO `roles` (`wholeseller`, `customer`, `retailer`, `user_id`, `created_at`, `updated_at`) VALUES ('1', '0', '1', '10', '2015-01-30 10:02:08.603594', '2015-01-30 10:02:08.603594')

	def update
		if params[:wholesale]
			if params[:wholesale][:id]
				@wholesellers=User.find(params[:wholesale][:id])
				@retail_check=@wholesellers.wholesales.new(:retailer_id=>params[:id])
				@retailer_check=@retail_check.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `retails` (`customer_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 1, '2015-02-12 07:04:04.632650', '2015-02-12 07:04:04.632650')
INSERT INTO `wholesales` (`retailer_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2015-02-12 06:21:45.990324', '2015-02-12 06:21:45.990324')