app/views/flower_shop/customer.html.erb

					<tbody class="retailer-view">
						<% Retail.where("customer_id=?",params[:id]).each do |ret| %>
						<% rets=User.find(ret.user_id) %>
---
SELECT `retails`.* FROM `retails` WHERE (customer_id='1')
SELECT `users`.* FROM `users` INNER JOIN `wholesales` ON `users`.`id` = `wholesales`.`retailer_id` WHERE `wholesales`.`user_id` = 1