app/views/flower_shop/index.html.erb

						<% @users.each do |whole| %>
						<% roler=Role.where("user_id=?",whole.id) %>
---
SELECT  `roles`.* FROM `roles` WHERE `roles`.`user_id` = 1 LIMIT 1