app/views/flower_shop/retailer.html.erb

					<tbody class="wholeseller-view">
						<% Wholesale.where("retailer_id=?",params[:id]).each do |whole| %>
						<% wholes=User.find(whole.user_id) %>
---
SELECT `wholesales`.* FROM `wholesales` WHERE (retailer_id='2')
SELECT `users`.* FROM `users` INNER JOIN `wholesales` ON `users`.`id` = `wholesales`.`user_id` WHERE `wholesales`.`user_id` = 2